Repository: cosZone/MoeKit
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld changes
zh_hans: %lld 处修改

source: %lld entries · unknown sizes are not zero
zh_hans: %lld 个条目 · 未知大小不等于零

source: %lld projects found. Choose which ones to add to your catalog.
zh_hans: 发现 %lld 个项目，请选择要收录的项目。

source: %lld records
zh_hans: %lld 条记录

source: %lld rows
zh_hans: %lld 行

source: %lld working directories
zh_hans: %lld 个工作目录

source: A native home for your personal CLI toolbox
zh_hans: 你的个人 CLI 原生工具箱

source: Actions use the selected working directory
zh_hans: 操作针对选定工作目录

source: Actual result
zh_hans: 实际结果

source: Adapter not connected
zh_hans: 适配器尚未连接

source: Add a folder or discover Git repositories in a location you choose.
zh_hans: 添加文件夹，或在指定位置发现 Git 仓库。

source: Add location…
zh_hans: 添加位置…

source: Add project
zh_hans: 添加项目

source: Add project…
zh_hans: 添加项目…

source: Add selected
zh_hans: 添加所选

source: Add this folder to MoeKit. Project files will not be changed.
zh_hans: 将此文件夹添加到 MoeKit，不会修改项目文件。

source: Add to review
zh_hans: 加入审核

source: All projects
zh_hans: 全部项目

source: All tasks
zh_hans: 全部任务

source: Apps
zh_hans: 应用

source: At least %@
zh_hans: 至少 %@

source: Automation
zh_hans: 自动化

source: Available
zh_hans: 可用

source: Branch
zh_hans: 分支

source: Browse
zh_hans: 浏览

source: Cancel
zh_hans: 取消

source: Cancel discovery
zh_hans: 取消发现

source: Cancelled
zh_hans: 已取消

source: Changes could not be saved: %@
zh_hans: 无法保存修改：%@

source: Choose a Mole analyze --json report. Importing does not execute Mole or modify the reported files.
zh_hans: 选择 Mole analyze --json 报告。导入不会执行 Mole 或修改报告中的文件。

source: Clean
zh_hans: 干净

source: Cleanup
zh_hans: 清理

source: Clear search
zh_hans: 清除搜索

source: Completed
zh_hans: 完成

source: Coverage unknown
zh_hans: 完整度未知

source: Demo fixture. No process was started.
zh_hans: 演示数据，没有启动任何进程。

source: Demo mode uses example projects and results. It never starts a process or changes project files.
zh_hans: 演示模式使用示例项目和结果，不会启动进程或修改项目文件。

source: Demo mode · example data
zh_hans: 演示模式 · 示例数据

source: Detail
zh_hans: 说明

source: Development
zh_hans: 开发

source: Diagnostics
zh_hans: 诊断

source: Discover
zh_hans: 发现

source: Discover in folder…
zh_hans: 在文件夹中发现…

source: Discover projects
zh_hans: 发现项目

source: Discover projects…
zh_hans: 发现项目…

source: Discover repositories in this folder, up to 4 levels. Dependencies and symbolic links are skipped.
zh_hans: 在此文件夹内发现仓库，最多搜索 4 层，跳过依赖目录和符号链接。

source: Discovering…
zh_hans: 正在发现…

source: Discovery
zh_hans: 项目发现

source: Discovery cancelled. No files were changed.
zh_hans: 已取消项目发现，没有修改文件。

source: Discovery reads Git metadata only. It does not run git status, hooks, fetch, or project scripts.
zh_hans: 项目发现只读取 Git 元数据，不会运行状态命令、钩子、远端更新或项目脚本。

source: Duration
zh_hans: 耗时

source: Example data
zh_hans: 示例数据

source: Example permission issue
zh_hans: 示例权限问题

source: Example record
zh_hans: 示例记录

source: Example records
zh_hans: 示例记录

source: Example result. No files were changed.
zh_hans: 示例结果，没有修改任何文件。

source: Example sizes
zh_hans: 示例大小

source: Exit demo
zh_hans: 退出演示

source: Expand or collapse working directories
zh_hans: 展开或折叠工作目录

source: Explore a Mole space report
zh_hans: 查看 Mole 空间报告

source: Explore demo
zh_hans: 查看演示

source: Failed
zh_hans: 失败

source: Filter
zh_hans: 筛选

source: Folder
zh_hans: 文件夹

source: Folder discovery appears here with its actual result and any unreadable paths.
zh_hans: 文件夹发现任务将在这里展示真实结果和无法读取的路径。

source: Found %lld projects in the selected scope.
zh_hans: 在选定范围内发现 %lld 个项目。

source: Git metadata
zh_hans: Git 元数据

source: Git repository
zh_hans: Git 仓库

source: Git working-tree status not checked
zh_hans: 尚未检查 Git 工作区状态

source: Hidden directories, symbolic links, dependency folders and build outputs are skipped. Discovery stops at a Git repository.
zh_hans: 跳过隐藏目录、符号链接、依赖和构建目录；发现 Git 仓库后不再向内搜索。

source: Import an existing analyze --json report. CLI scanning will be connected in a later milestone.
zh_hans: 导入已有的 analyze --json 报告。CLI 扫描将在后续阶段接入。

source: Import report
zh_hans: 导入报告

source: Import report…
zh_hans: 导入报告…

source: Imported report · upstream-reported sizes
zh_hans: 导入报告 · 大小为上游报告值

source: In progress
zh_hans: 进行中

source: Inspector
zh_hans: 详情

source: Kind
zh_hans: 类型

source: Last access (reported)
zh_hans: 上游访问时间

source: Last opened
zh_hans: 最近打开

source: List
zh_hans: 列表

source: Maintenance
zh_hans: 维护

source: Maximum depth
zh_hans: 最大深度

source: Maximum directories
zh_hans: 最大目录数

source: Measured within scan scope
zh_hans: 已读取扫描范围

source: Mole JSON reports can be imported into Space. Cleanup, uninstall, maintenance and live status execution are not connected in this milestone.
zh_hans: 可以在空间页导入 Mole JSON 报告。本阶段尚未连接清理、卸载、维护和实时状态执行。

source: Name
zh_hans: 名称

source: Needs attention
zh_hans: 需要处理

source: No diagnostic output
zh_hans: 没有诊断输出

source: No matching entries
zh_hans: 没有匹配的条目

source: No matching projects
zh_hans: 没有匹配的项目

source: No process has been started
zh_hans: 尚未启动任何进程

source: No project files were changed.
zh_hans: 没有修改项目文件。

source: No report imported
zh_hans: 尚未导入报告

source: No tasks yet
zh_hans: 还没有任务

source: Not checked
zh_hans: 未检查

source: Not fully read
zh_hans: 未完整读取

source: Not read
zh_hans: 未读取

source: OK
zh_hans: 好

source: Other
zh_hans: 其他

source: Overview locations may overlap
zh_hans: 概览位置可能重叠

source: Partial discovery. Open Tasks to inspect skipped paths and scan limits.
zh_hans: 发现结果不完整。请在任务页查看跳过的路径和扫描限制。

source: Partial result
zh_hans: 部分结果

source: Partially measured
zh_hans: 部分读取

source: Path
zh_hans: 路径

source: Pin project
zh_hans: 置顶项目

source: Pinned
zh_hans: 已置顶

source: Preview
zh_hans: 预览

source: Productivity
zh_hans: 效率

source: Project
zh_hans: 项目

source: Project / working directory
zh_hans: 项目 / 工作目录

source: Project discovery
zh_hans: 项目发现

source: Project filter
zh_hans: 项目筛选

source: Projects
zh_hans: 项目

source: Read status
zh_hans: 读取状态

source: Recently opened
zh_hans: 最近打开

source: Records
zh_hans: 记录

source: Report data is not a cleanup plan
zh_hans: 报告数据不是清理执行计划

source: Report exceeds the 16 MB import limit.
zh_hans: 报告超过 16 MB 导入限制。

source: Report receipt time is not measurement time
zh_hans: 报告接收时间不是测量时间

source: Repository group
zh_hans: 仓库分组

source: Review discovered projects
zh_hans: 审核发现的项目

source: Review only
zh_hans: 仅供审核

source: Review project outputs
zh_hans: 审核项目产物

source: Run
zh_hans: 运行

source: Running
zh_hans: 进行中

source: Search
zh_hans: 搜索

source: Select a project
zh_hans: 选择一个项目

source: Select an entry
zh_hans: 选择一个条目

source: Selected folders only
zh_hans: 仅限选定文件夹

source: Selected-path mutation is not implemented. No cleanup command will be run.
zh_hans: 尚未实现按选定路径执行变更，不会运行清理命令。

source: Settings
zh_hans: 设置

source: Show or hide project details
zh_hans: 显示或隐藏项目详情

source: Size
zh_hans: 大小

source: Space
zh_hans: 空间

source: Started
zh_hans: 开始时间

source: Status
zh_hans: 状态

source: Storage
zh_hans: 存储

source: System
zh_hans: 系统

source: Target
zh_hans: 目标

source: Task
zh_hans: 任务

source: Task filter
zh_hans: 任务筛选

source: Task records are kept for this session
zh_hans: 任务记录保留于本次会话

source: Tasks
zh_hans: 任务

source: The existing catalog could not be read. Changes are temporary until the catalog is recovered; the original file was not overwritten.
zh_hans: 无法读取现有清单。恢复前的修改仅临时保留，原文件未被覆盖。

source: The project catalog could not be read. Existing data was not replaced.
zh_hans: 无法读取项目清单，原有数据未被覆盖。

source: This capability is not connected yet.
zh_hans: 此能力尚未连接。

source: This session
zh_hans: 本次会话

source: Tool
zh_hans: 工具

source: Tools
zh_hans: 工具

source: Treemap
zh_hans: 矩形树图

source: Treemap requires complete, non-overlapping directory totals
zh_hans: 矩形树图需要完整且不重叠的目录统计

source: Try a different search or filter.
zh_hans: 请尝试其他搜索或筛选条件。

source: Try a different search. Empty results do not prove an empty disk.
zh_hans: 请尝试其他搜索。空结果不代表磁盘为空。

source: Unavailable
zh_hans: 无法读取

source: Unknown
zh_hans: 未知

source: Unknown-size entries
zh_hans: 大小未知的条目

source: Unpin project
zh_hans: 取消置顶

source: Use demo data
zh_hans: 使用演示数据

source: Use tools
zh_hans: 使用工具

source: View
zh_hans: 视图

source: Working directories
zh_hans: 工作目录

source: Worktree
zh_hans: 工作目录

source: Your project list and pins are stored in MoeKit’s Application Support folder. Task records and imported reports last for the current session.
zh_hans: 项目清单和置顶信息保存在 MoeKit 的应用支持目录。任务记录和导入报告保留于本次会话。

source: Your projects, in one place
zh_hans: 在一处管理你的项目

source: Open tools
zh_hans: 打开工具

source: Select a working directory to reveal it in Finder
zh_hans: 选择工作目录，可在 Finder 中显示

source: Choose a regular JSON report file, not a folder or symbolic link.
zh_hans: 请选择普通 JSON 报告文件，而不是目录或符号链接。

source: Git working directory
zh_hans: Git 工作目录

source: Mole execution is not connected in this milestone.
zh_hans: 本阶段尚未连接 Mole 执行。

source: Inspect directory sizes, large files, and scan coverage.
zh_hans: 查看目录大小、大文件和扫描完整度。

source: Review caches, project artifacts, and installers.
zh_hans: 审核缓存、项目产物和安装包。

source: Review installed apps and their related files.
zh_hans: 审核已安装应用及其关联文件。

source: Understand maintenance tasks and their effects.
zh_hans: 了解维护任务及其影响。

source: Inspect system metrics and their freshness.
zh_hans: 查看系统指标及其时效。

source: A native workspace for disk analysis, cleanup, apps, maintenance, and status.
zh_hans: 用于磁盘分析、清理、应用、维护和状态的原生工作台。

source: %lld exact targets
zh_hans: %lld 个精确目标

source: %lld inferred processes
zh_hans: %lld 个推断关联的进程

source: %lld processes exited, became unreadable, or could not be verified as belonging to the current user.
zh_hans: %lld 个进程已退出、不可读取或无法确认属于当前用户。

source: %lld processes · %lld selected
zh_hans: %lld 个进程 · 已选 %lld 个

source: %lld rows were discarded because identity changed or could not be revalidated during the scan.
zh_hans: %lld 个条目因扫描期间身份变化或无法重新验证而被舍弃。

source: A future stop must re-read identities and prefer cooperative shutdown. A submitted signal would not prove exit.
zh_hans: 未来执行停止前必须重新读取身份，并优先协作式退出。提交信号并不代表进程已退出。

source: A matching MoeKit launch record is required.
zh_hans: 需要匹配的 MoeKit 启动记录。

source: Application, browser, IDE, database, VM, or shared-service hint. Review individually.
zh_hans: 具有应用、浏览器、IDE、数据库、虚拟机或共享服务特征，请逐项检查。

source: Association evidence
zh_hans: 关联依据

source: Association is inferred from the working directory. Opening this view does not scan.
zh_hans: 根据工作目录推断关联。打开此视图不会启动扫描。

source: Cancel scan
zh_hans: 取消扫描

source: Close
zh_hans: 关闭

source: Current UID: %lld
zh_hans: 当前 UID：%lld

source: Current user only. TCP listening ports and project associations reflect this snapshot; unknown readings are not empty results.
zh_hans: 仅显示当前用户的进程。TCP 监听端口与项目关联仅反映此快照；未知读数不代表没有结果。

source: Current user · read-only
zh_hans: 当前用户 · 只读

source: Executable path
zh_hans: 可执行文件路径

source: Executable path unavailable; process identity is incomplete.
zh_hans: 可执行文件路径不可用，进程身份信息不完整。

source: Execution unavailable
zh_hans: 无法执行

source: Inferred from working directory
zh_hans: 根据工作目录推断

source: Inspect an exact-selection plan before a future stopping capability.
zh_hans: 在后续停止功能接入前，检查精确选择的计划。

source: Inspect current-user processes, TCP listeners and observed project associations.
zh_hans: 查看当前用户的进程、TCP 监听端口与观察到的项目关联。

source: Inspect exact targets and risks. Stopping processes is unavailable.
zh_hans: 查看精确目标与风险。尚不支持停止进程。

source: Inspect processes
zh_hans: 检查进程

source: Inspect running processes
zh_hans: 查看运行中的进程

source: Inspection only. Process stopping, graceful termination, and force termination are unavailable. No signals will be sent.
zh_hans: 仅供查看。尚不支持停止进程、正常终止或强制终止。不会发送任何信号。

source: Listening ports
zh_hans: 监听端口

source: Multiple processes selected
zh_hans: 已选择多个进程

source: No flagged risks
zh_hans: 未标记风险

source: No flagged risks. This is not a safety guarantee.
zh_hans: 未标记风险，但这不保证安全。

source: No matching processes
zh_hans: 没有匹配的进程

source: No project association was established from readable metadata.
zh_hans: 未能从可读取的元数据确定项目关联。

source: No project ownership was established.
zh_hans: 尚未确定项目所有权。

source: None observed
zh_hans: 未观察到

source: Not scanned
zh_hans: 尚未扫描

source: Observed %lld processes. No processes were changed.
zh_hans: 观察到 %lld 个进程，未更改任何进程。

source: Observed association
zh_hans: 观察到的关联

source: Observed working directory is inside this project's canonical folder. This is an association, not ownership.
zh_hans: 观察到的工作目录位于此项目的规范路径内。这仅表明关联，不代表所有权。

source: Only exact selected identities are listed. Parents, children and process groups are not added automatically.
zh_hans: 仅列出精确选中的进程身份，不会自动加入父进程、子进程或整个进程组。

source: Open related processes
zh_hans: 打开关联进程

source: Parent PID
zh_hans: 父进程 PID

source: Parent is unavailable or reparented. This does not mean the process is abandoned.
zh_hans: 父进程不可用或已重新指定，不代表此进程已被遗留。

source: Partial snapshot
zh_hans: 不完整快照

source: Plan warnings
zh_hans: 计划警告

source: Preview only. Stopping and force stopping are not implemented.
zh_hans: 仅供预览，尚未实现停止和强制停止。

source: Process details
zh_hans: 进程详情

source: Process group
zh_hans: 进程组

source: Process identity is incomplete.
zh_hans: 进程身份信息不完整。

source: Process name is unavailable.
zh_hans: 进程名称不可用。

source: Process name unavailable.
zh_hans: 进程名称不可用。

source: Process scan cancelled. No processes were changed.
zh_hans: 进程扫描已取消，未更改任何进程。

source: Process scanning is unavailable in Demo. Exit Demo to explicitly scan your current user’s processes.
zh_hans: 演示模式下无法扫描进程。退出演示模式后，可手动扫描当前用户的进程。

source: Process start time is inconsistent with this snapshot.
zh_hans: 进程启动时间与此快照不一致。

source: Process start time unavailable; process identity is incomplete.
zh_hans: 启动时间不可用，进程身份信息不完整。

source: Processes & Ports
zh_hans: 进程与端口

source: Project association
zh_hans: 项目关联

source: Protected
zh_hans: 受保护

source: Protection
zh_hans: 保护状态

source: Read a bounded snapshot of the current user’s processes and TCP listening ports
zh_hans: 读取当前用户的进程与 TCP 监听端口的有范围限制快照

source: Read-only snapshot
zh_hans: 只读快照

source: Read-only · no process signals are sent
zh_hans: 只读 · 不发送进程信号

source: Refresh
zh_hans: 刷新

source: Related processes
zh_hans: 关联进程

source: Review stop plan
zh_hans: 查看停止计划

source: Review the plan to inspect every selected identity and its risks. No stop action is available.
zh_hans: 查看计划以检查每个所选进程的身份与风险。尚不支持执行停止操作。

source: Scan diagnostics
zh_hans: 扫描诊断

source: Scan on demand. No automatic polling or process changes.
zh_hans: 按需扫描，不自动轮询或更改进程。

source: Scanning…
zh_hans: 正在扫描…

source: Select a process
zh_hans: 选择一个进程

source: Select a row to inspect identity, listening ports, project evidence, and protection reasons.
zh_hans: 选择一行以查看进程身份、监听端口、项目关联依据与保护原因。

source: Selected project
zh_hans: 所选项目

source: Show all processes
zh_hans: 显示所有进程

source: Snapshot
zh_hans: 快照

source: Snapshot ID
zh_hans: 快照 ID

source: Some metadata is unavailable or incomplete.
zh_hans: 部分元数据不可用或不完整。

source: Some selected identities are no longer in this snapshot.
zh_hans: 部分选中的进程身份已不在此快照中。

source: Start a bounded, read-only scan when you’re ready. Nothing is scanned automatically.
zh_hans: 准备好后启动有范围限制的只读扫描。不会自动扫描。

source: Start identity (s / µs)
zh_hans: 启动时间标识（秒 / 微秒）

source: Start scan
zh_hans: 开始扫描

source: Started by MoeKit
zh_hans: 由 MoeKit 启动

source: Stop processes
zh_hans: 停止进程

source: Stopping and force stopping are not implemented.
zh_hans: 尚未实现停止和强制停止。

source: System process or MoeKit itself.
zh_hans: 系统进程或 MoeKit 自身。

source: System service or shared shell. Review individually.
zh_hans: 系统服务或共享 shell，请逐项检查。

source: TCP listener coverage unknown: a local listener address could not be decoded.
zh_hans: TCP 监听覆盖情况未知：无法解析本地监听地址。

source: TCP listener coverage unknown: a socket closed or became unreadable during the scan.
zh_hans: TCP 监听覆盖情况未知：socket 在扫描期间关闭或变得不可读。

source: TCP listener coverage unknown: a socket descriptor was invalid.
zh_hans: TCP 监听覆盖情况未知：socket 描述符无效。

source: TCP listener coverage unknown: file descriptors could not be read.
zh_hans: TCP 监听覆盖情况未知：无法读取文件描述符。

source: TCP listener coverage unknown: the per-process file descriptor limit was reached.
zh_hans: TCP 监听覆盖情况未知：已达到每进程文件描述符上限。

source: The current user's process list could not be read (system error %d).
zh_hans: 无法读取当前用户的进程列表（系统错误 %d）。

source: The observed process group includes unselected processes. No group action is planned.
zh_hans: 观察到的进程组包含未选中的进程，不会计划对整个组执行操作。

source: The process limit was reached; some processes were not inspected.
zh_hans: 已达到进程数量上限，部分进程未检查。

source: The process owner is different or unknown.
zh_hans: 进程所属用户不同或未知。

source: The process snapshot could not be read. No processes were changed.
zh_hans: 无法读取进程快照，未更改任何进程。

source: The scan time budget was reached; unfinished rows were discarded.
zh_hans: 已达到扫描时限，未完成读取的条目已舍弃。

source: This is a partial snapshot; unseen processes or dependencies may exist.
zh_hans: 这是部分快照，可能存在尚未观察到的进程或依赖关系。

source: This snapshot is stale or has an invalid timestamp. Refresh before reviewing a future action.
zh_hans: 此快照已过期或时间戳无效，请刷新后再评估后续操作。

source: Try another search or project filter. A partial snapshot may omit unreadable processes.
zh_hans: 请尝试其他搜索条件或项目筛选。不完整快照可能遗漏无法读取的进程。

source: Unattributed
zh_hans: 归属未知

source: Unavailable in Demo
zh_hans: 演示模式下不可用

source: Unavailable metadata
zh_hans: 无法读取的元数据

source: Use 1–16,384 processes, 1–4,096 descriptors per process, and a finite duration above zero and at most 30 seconds.
zh_hans: 进程上限须为 1–16,384，每进程描述符上限为 1–4,096，时限须大于零且不超过 30 秒。

source: Wait a moment before starting another process scan.
zh_hans: 请稍候再开始下一次进程扫描。

source: Working directory
zh_hans: 工作目录

source: Working directory unavailable or could not be resolved.
zh_hans: 工作目录不可用或无法解析。

source: Cancel process scan
zh_hans: 取消进程扫描

source: About
zh_hans: 关于

source: About MoeKit
zh_hans: 关于 MoeKit

source: Build %@
zh_hans: 构建 %@

source: Feedback
zh_hans: 反馈

source: General
zh_hans: 通用

source: Give a Star
zh_hans: 点个 Star

source: Open MoeKit’s GitHub issues in your browser
zh_hans: 在浏览器中打开 MoeKit 的 GitHub 问题列表

source: Open the MoeKit repository to give it a star on GitHub
zh_hans: 打开 MoeKit 仓库，在 GitHub 上点个 Star

source: Opens GitHub in your default browser
zh_hans: 在默认浏览器中打开 GitHub

source: Version %@
zh_hans: 版本 %@

source: Version %@ (%@)
zh_hans: 版本 %@（%@）

source: Version unavailable
zh_hans: 版本信息不可用

source: %lld exact targets · %lld protected
zh_hans: %lld 个精确目标 · %lld 个受保护

source: %lld project folders could not be resolved. Associations may be missing.
zh_hans: %lld 个项目文件夹未能解析，可能缺少相关关联。

source: All processes
zh_hans: 全部进程

source: Clear filters
zh_hans: 清除筛选

source: Matched project folder
zh_hans: 匹配的项目文件夹

source: Multiple catalog projects resolve to the same matching folder. No project was chosen.
zh_hans: 多个已收录项目指向同一个匹配目录，因此未选择任何项目。

source: No TCP listeners match these filters. Unknown port readings and unreadable processes may still hide listeners.
zh_hans: 没有匹配筛选条件的 TCP 监听进程。端口未知或无法读取的进程仍可能有监听端口。

source: No processes observed
zh_hans: 未观测到进程

source: No readable project folders were available for this scan. Add a project, then refresh to compare its folder.
zh_hans: 本次扫描没有可读取的项目文件夹。添加项目后刷新，即可比较其目录。

source: No unknown port readings match these filters. A partial snapshot may still omit unreadable processes.
zh_hans: 没有匹配筛选条件的端口未知记录。部分快照仍可能遗漏无法读取的进程。

source: Port coverage
zh_hans: 端口读取情况

source: Protected rows remain in this inspection so you can understand why they need individual review. Selecting a row does not authorize stopping it.
zh_hans: 受保护的记录会保留在检查中，以便了解需要单独审查的原因。选中记录不代表授权停止该进程。

source: Reading current-user metadata. You can cancel the scan at any time.
zh_hans: 正在读取当前用户的进程信息，随时可以取消扫描。

source: Reading process snapshot…
zh_hans: 正在读取进程快照…

source: Refresh cancelled. Showing the previous snapshot; these rows were not refreshed.
zh_hans: 刷新已取消。当前显示上一次快照，这些记录尚未刷新。

source: Refresh failed. Showing the previous snapshot; these rows were not refreshed.
zh_hans: 刷新失败。当前显示上一次快照，这些记录尚未刷新。

source: Refreshing. The previous snapshot remains visible until the scan finishes.
zh_hans: 正在刷新。扫描完成前继续显示上一次快照。

source: Scan cancelled
zh_hans: 扫描已取消

source: Snapshot unavailable
zh_hans: 快照不可用

source: TCP listeners
zh_hans: TCP 监听进程

source: The observed working directory is outside the project folders resolved for this snapshot.
zh_hans: 观测到的工作目录不在本次快照已解析的项目文件夹内。

source: The scan did not produce a snapshot. Start a new scan to retry; no processes were changed.
zh_hans: 本次扫描未能生成快照，可重新扫描以重试；没有更改任何进程。

source: The scan was cancelled. No processes were changed. Start a new scan when you’re ready.
zh_hans: 扫描已取消，没有更改任何进程。准备好后可重新开始扫描。

source: Unknown ports
zh_hans: 端口未知

source: Working directory is unavailable or unresolved. Names, ports and parent processes do not establish a project association.
zh_hans: 工作目录不可用或未能解析。名称、端口和父进程不能作为项目关联依据。

source: This is not a verified linked worktree. Repository and folder removal is protected.
zh_hans: 此目录尚未验证为关联 worktree。仓库和文件夹受到保护，不能移除。

source: Git marks this worktree as locked. Preserve it until the lock is reviewed.
zh_hans: Git 将此 worktree 标记为已锁定。请先检查锁定原因，并保留此目录。

source: The Git relationship is unknown or unreadable.
zh_hans: Git 关联关系未知或无法读取。

source: Uncommitted changes and untracked files have not been checked.
zh_hans: 尚未检查未提交的改动和未跟踪文件。

source: Unpushed commits, upstream tracking and remote reachability have not been checked.
zh_hans: 尚未检查未推送提交、上游跟踪关系和远程可达性。

source: Active use and ownership have not been verified. A process snapshot cannot prove a directory is unused.
zh_hans: 尚未验证使用状态和归属。进程快照无法证明某个目录已不再使用。

source: Discovery is a snapshot. All safety checks would need to be repeated before any future cleanup.
zh_hans: 发现结果只是快照。未来执行任何清理前，都必须重新完成全部安全检查。

source: Discover repositories in up to 32 selected folders, up to 4 levels each. One shared budget applies. Dependencies and symbolic links are skipped.
zh_hans: 在最多 32 个所选文件夹内发现仓库，每处最多搜索 4 层，所有位置共用扫描限额。跳过依赖目录和符号链接。

source: %lld projects found. Existing paths update metadata without changing pins or history.
zh_hans: 发现 %lld 个项目。已有路径仅更新元数据，保留置顶状态和历史。

source: Filter by name, path or branch
zh_hans: 按名称、路径或分支筛选

source: Select visible
zh_hans: 选择可见项目

source: Clear selection
zh_hans: 清空选择

source: %lld selected · %lld visible
zh_hans: 已选 %lld 项 · 可见 %lld 项

source: Update existing
zh_hans: 更新已有项目

source: Unknown branch
zh_hans: 分支未知

source: No repositories found
zh_hans: 未发现仓库

source: Add or update selected
zh_hans: 添加或更新所选

source: %lld directories inspected · %lld/%lld folders finished
zh_hans: 已检查 %lld 个目录 · 完成 %lld/%lld 个文件夹

source: Preparing discovery…
zh_hans: 正在准备发现…

source: Git worktree lock observed
zh_hans: 扫描时发现 Git worktree 锁定标记

source: Cleanup safety
zh_hans: 清理安全复查

source: Verified worktree relationship
zh_hans: 已验证 worktree 关联关系

source: Locked when scanned
zh_hans: 扫描时已锁定

source: No lock observed
zh_hans: 扫描时未发现锁定

source: Shared Git metadata directory
zh_hans: 共享 Git 元数据目录

source: Cleanup safety review
zh_hans: 清理安全复查

source: Protected · not eligible for cleanup
zh_hans: 已保护 · 不符合清理条件

source: Review only. No deletion is available and no reclaimable space has been measured.
zh_hans: 仅供复查。不提供删除操作，也未测量可回收空间。

source: Sort
zh_hans: 排序

source: Lock
zh_hans: 锁定

source: Observed
zh_hans: 观察时间

source: Done
zh_hans: 完成

source: %lld selected projects are outside this filter and will also be imported.
zh_hans: 有 %lld 个已选项目不在当前筛选结果中，也将被导入。

source: Add or update %lld selected
zh_hans: 添加或更新 %lld 个已选项目

source: Collapsed
zh_hans: 已折叠

source: Discovered projects
zh_hans: 发现的项目

source: Discovering projects…
zh_hans: 正在发现项目…

source: Discovery and process scans appear here with their actual results.
zh_hans: 目录发现和进程扫描的实际结果会显示在这里。

source: Expanded
zh_hans: 已展开

source: Filter discovered projects
zh_hans: 筛选发现的项目

source: Hidden
zh_hans: 已隐藏

source: Importing report…
zh_hans: 正在导入报告…

source: Matching working directories stay expanded while filtering
zh_hans: 筛选时，匹配的工作目录保持展开
